<!DOCTYPE html><html lang="de"><head><meta charset="utf-8"><title>Bewerbung als Software Developer Microsoft SharePoint (all genders) – adesso SE</title><meta name="viewport" content="width=device-width, initial-scale=1"><style>body{font-family:Arial,Helvetica,sans-serif;color:#222;margin:0;padding:0;background:#f7f7f9;} .wrapper{max-width:760px;margin:24px auto;padding:24px;background:#fff;border:1px solid #e5e7eb;border-radius:10px;} .header{display:flex;justify-content:space-between;align-items:flex-start;margin-bottom:16px;} .name{font-size:22px;font-weight:700;color:#0f172a;} .contact{font-size:13px;color:#334155;text-align:right;} h1{font-size:20px;margin:16px 0 8px 0;color:#0f172a;} p{line-height:1.55;margin:10px 0;} .badge{display:inline-block;background:#0ea5e9;color:#fff;padding:4px 8px;border-radius:6px;font-size:12px;margin-bottom:8px;} .list{margin:10px 0 0 0;padding-left:18px;} .list li{margin:6px 0;} .footer{margin-top:18px;font-size:13px;color:#475569;} .signature{margin-top:18px;font-weight:700;}</style></head><body><div class="wrapper"><div class="header"><div class="name">Lukas Schneider</div><div class="contact">Hamburg<br>+49 170 1234567<br>lukas.schneider@example.com<br>linkedin.com/in/lukas-schneider</div></div><div class="badge">Bewerbung: Software Developer Microsoft SharePoint (Hamburg)</div><h1>Sehr geehrtes Recruiting-Team der adesso SE,</h1><p>mit großer Motivation bewerbe ich mich auf die Position &quot;Software Developer Microsoft SharePoint (all genders)&quot; in Hamburg. Euer Anspruch, Kerngesch&auml;ftsprozesse mit modernen, cloud-ready L&ouml;sungen zu optimieren, deckt sich mit meiner Leidenschaft, robuste und nutzerzentrierte Anwendungen zu entwickeln.</p><p>Ich bringe fundierte Erfahrung in der Entwicklung mit React und TypeScript sowie in der Umsetzung moderner Frontends mit. In den letzten Jahren habe ich produktiv mit dem SharePoint Framework (SPFx) gearbeitet und Webparts, Extensions und Adaptive Cards mit React, TypeScript sowie PnP-JS implementiert. F&uuml;r Integrationen und Backends nutzte ich .NET (Core/6+) sowie REST/Graph-APIs. Skripting- und Betriebsaufgaben habe ich mit PowerShell (PnP PowerShell, Site- und Berechtigungsverwaltung, Update-/Deployment-Skripte) und Azure DevOps Pipelines automatisiert.</p><ul class="list"><li>SharePoint Online und On-Prem (2019/SE): Entwicklung, Erweiterung und Betrieb von L&ouml;sungen inkl. CSOM/JSOM und Webhooks</li><li>SPFx-Entwicklung: React, TypeScript, HTML/CSS, Reusable Components, Unit- und UI-Tests</li><li>Komponenten &amp; Plattform: Anpassung von Templates, Inhaltstypen, Suche, App Launcher, Term Store und Metadaten</li><li>CI/CD: Build- und Release-Pipelines (Azure DevOps), Code-Reviews, Branching-Strategien, automatisierte Tests</li><li>Beratung: Aufnahme von Anforderungen, technische Analysen, Konzeption und enge Zusammenarbeit mit Stakeholdern</li></ul><p>Aus meinen Projekten bringe ich ein hohes Qualit&auml;ts- und Produktfokus mit: F&uuml;r eine Lotterie-Website eines Bundesligasponsors habe ich das Frontend mit HTML, CSS und JavaScript verantwortet – die Kampagne steigerte signifikant die Conversion. F&uuml;r ein Campervan-Vermietungsunternehmen habe ich mit Angular den kompletten Buchungsprozess neu gestaltet, wodurch die Abbruchraten deutlich sanken und mehr Buchungen zustande kamen. Regelm&auml;&szlig;ig setze ich React und Angular ein, serverseitig arbeite ich mit Node.js/Express; TypeScript nutze ich zur Sicherung der Codequalit&auml;t. Qualit&auml;t stelle ich mit automatisierten Tests (Jest, Puppeteer) sicher.</p><p>Warum adesso? Eure ausgepr&auml;gte Lern- und Feedbackkultur, die vielf&auml;ltigen Trainingsangebote sowie das hierarchie&uuml;bergreifende Miteinander passen ideal zu meiner Arbeitsweise. Ich sch&auml;tze eine Kultur, in der wir gemeinsam mit Kundinnen und Kunden pragmatische, saubere L&ouml;sungen bauen – genau das, wof&uuml;r adesso steht und wof&uuml;r ihr als &quot;Deutschlands Beste Arbeitgeber in der ITK&quot; ausgezeichnet wurdet.</p><p>Ich kommuniziere verhandlungssicher auf Deutsch und flie&szlig;end auf Englisch, arbeite strukturiert in cross-funktionalen Teams und &uuml;bernehme Verantwortung von der technischen Analyse &uuml;ber das Konzept bis zur Umsetzung und den Betrieb. Gerne bringe ich meine Erfahrung in SharePoint Online, SPFx, React, TypeScript, .NET sowie in CI/CD ein und wachse gemeinsam mit euch weiter.</p><p>&Uuml;ber ein pers&ouml;nliches Gespr&auml;ch freue ich mich sehr. Meine fr&uuml;hestm&ouml;gliche Verf&uuml;gbarkeit ist kurzfristig, Gehaltswunsch und weitere Details bespreche ich gerne im Austausch.</p><p class="signature">Mit freundlichen Gr&uuml;&szlig;en<br>Lukas Schneider</p><p class="footer">Anlagen: Lebenslauf, Zeugnisse, Projekt&uuml;bersicht</p></div></body></html>